cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'caskroom/versions'

brew 'ack'
brew 'coreutils'
brew 'gdbm', args: ['universal']
brew 'git'
brew 'imagemagick'
brew 'jenv'
brew 'jp2a'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline', args: ['universal']
brew 'p7zip'
brew 'postgresql'
brew 'sqlite', args: ['universal']
brew 'unrar'

brew 'python'
brew 'python3'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'hugin'
cask 'libreoffice'
cask 'java6'
cask 'java7'
cask 'seashore'
cask 'sublime-text3'
cask 'telegram'
cask 'vlc'
