cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'caskroom/versions'

# To install App from AppStore
brew 'mas'

brew 'ack'
brew 'asciidoc'
brew 'binutils'
brew 'coreutils'
brew 'curl', args: ['with-openssl', 'with-libssh2']
brew 'gdbm', args: ['universal']
brew 'ghostscript', args: ['with-x11']
brew 'git'
#brew 'gpg'
brew 'gpg2', args: ['with-readline']
brew 'imagemagick', args: ['with-ghostscript']
brew 'ipcalc'
brew 'jenv'
brew 'jp2a'
brew 'libgit2'
brew 'libimobiledevice'
brew 'libpng'
brew 'openssl'
brew 'npm', args: ['with-openssl']
brew 'readline', args: ['universal']
brew 'oath-toolkit'
brew 'p7zip'
brew 'pinentry-mac'
brew 'pngcrush'
brew 'postgresql', args: ['with-python']
brew 's3cmd'
brew 'sqlite', args: ['universal']
brew 'tree'
brew 'unrar'

brew 'python'
brew 'python3'
#brew 'pyenv-virtualenv'
#brew 'pyenv-virtualenvwrapper'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'wget', args: ['with-debug']
# brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

cask 'bitbar'
cask 'calibre'
cask 'cyberduck'
cask 'dropbox'
cask 'firefox'
cask 'freemind'
cask 'google-chrome'
cask 'handbrake'
cask 'hugin'
cask 'libreoffice'
cask 'java6'
cask 'java7'
cask 'java'
cask 'keybase'
cask 'pencil'
cask 'qlmarkdown'
cask 'seashore'
cask 'sequel-pro'
cask 'sizeup'
cask 'sketchup'
cask 'skype'
cask 'sublime-text3'
cask 'telegram'
#cask 'tunnelblick'
cask 'vlc'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

cask 'xquartz'
cask 'inkscape'

mas 'Apple Configurator 2', id: 1037126344
mas 'OTP Manager', id: 928941247
mas 'MiniUsage', id: 416285394
mas 'PDFScanner', id: 410968114
mas 'TextWrangler', id: 404010395
mas 'Microsoft Remote Desktop', id: 715768417
mas 'WiFi Explorer', id: 494803304
mas 'Money', id: 402410845

#####################
# Development tools #
#####################

brew 'cairo'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'geoip'
brew 'gradle'
brew 'kafkacat'
brew 'maven'
#brew 'mysql-connector-c'
# Must use MySQL 5.6 for cloudstack 4.4
brew 'homebrew/version/mysql56'
brew 'pango'
brew 'redis'
brew 'yarn'

cask 'dockertoolbox'
#cask 'eclipse-jee'
