cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'caskroom/versions'

brew 'ack'
brew 'binutils'
brew 'coreutils'
brew 'gdbm', args: ['universal']
brew 'git'
brew 'gpg2', args: ['with-readline']
brew 'imagemagick'
brew 'jenv'
brew 'jp2a'
brew 'libgit2'
brew 'openssl'
brew 'npm', args: ['with-openssl']
brew 'readline', args: ['universal']
brew 'oath-toolkit'
brew 'p7zip'
brew 'pngcrush'
brew 'postgresql', args: ['with-python']
brew 'sqlite', args: ['universal']
brew 'unrar'

brew 'python'
brew 'python3'
#brew 'pyenv-virtualenv'
#brew 'pyenv-virtualenvwrapper'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

cask 'calibre'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'hugin'
cask 'libreoffice'
cask 'java6'
cask 'java7'
cask 'java'
cask 'pencil'
cask 'seashore'
cask 'sequel-pro'
cask 'sizeup'
cask 'skype'
cask 'sublime-text3'
cask 'telegram'
#cask 'tunnelblick'
cask 'vlc'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

#####################
# Development tools #
#####################

brew 'cairo'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'geoip'
brew 'gradle'
brew 'kafkacat'
brew 'maven'
#brew 'mysql-connector-c'
# Must use MySQL 5.6 for cloudstack 4.4
brew 'homebrew/version/mysql56'
brew 'pango'
brew 'redis'

cask 'dockertoolbox'
#cask 'eclipse-jee'
